<template><div><h1 id="关于作者" tabindex="-1"><a class="header-anchor" href="#关于作者" aria-hidden="true">#</a> 关于作者</h1>
<p>本人毕业于一所边缘的本科院校，专业是软件工程，刚进入这个专业的时候，我连这个专业是做什么的都不是很清楚，
甚至有同学告诉我说，学校教的东西都不用学，只要拿到毕业证，学习一门编程语言就可以随便找工作，我当时甚至一度以为这是真的...
后来到了大二暑假的时候，那时候我还在家乡兼职暑假工，平时在家也不知道干什么，就开始自己学习，也不知道学什么，毫无方向，
在我一通乱学之下，我巧然打开了新世界的大门。</p>
<p>当时我是在阿里云的开发者社区中发现的学习路线图，然后就开始学习了，首先学的是前端的一些知识，像html,css,js等，为我之后进入java做一些铺垫，毕竟前端的知识还是有必要学习一下的。
大二开学，我就开始正式学习java了，直到大三结束，我才把java、mysql、spring、spirngmvc、springboot、myabits等学习完毕，在没有人帮助的情况下，
每次遇到bug都是自己解决，说实话，这一路上真的很不容易！</p>
<p>大三结束后，本打算参加一份实习积累一下经验的，但是被同学告知，秋招马上开始了，说实话，像我这种农村出来的学生，没见过大世面，我甚至不知道有秋招。</p>
<p>听说了这件事情之后，我当时就好好了解了一下，通过b站，抖音，百度什么的，发现互联网行业面试需要掌握很多的知识点，但是平时学习的东西，理解是理解了，但是却不能完整的说出来。
这也让我感到很有压力，最后连续奋战了一个暑假，把面试题什么的全部都好好背了一遍，但是很不幸，22年秋招堪称地域级别，想要进一个还不错的公司太难了。
我一边上课一边投简历，中途也接到了几次面试的机会，但是无奈，除了一些比较大的公司外，很多公司都不支持线上面试，而当时疫情正严重，辅导员老师不放我出校门面试，真实难为死我了。</p>
<p>这篇博客主要记录一些自己的学习经验和笔记，虽然对于我来说成为全栈工程师还有超级远的路要走，但是希望还是有的，希望这篇博客可以见证自己的成功！
对于我来说，真正的顶级大佬都是神一般的存在，因此我也把这篇博客命名为了成神之路，寓意自己将来也可以成为一名顶级大佬...</p>
<p>路依然遥远，尚不能停歇！</p>
</div></template>


